[{
  "_id": {
    "$oid": "651ba78c2bf533ab49803dd4"
  },
  "article": "Since we broke the news of the market bonus scale for associates at large law firms in the United States — a trend that was started by Baker McKenzie on Monday, November 21, 2022, and finally followed by Cravath on Monday, November 29, 2022 — firms are slowly falling in line to match the scale. When will your firm announce its bonuses?\nAs usual, we are compiling a table of all the firms that have already matched the new bonus scale, the minimum hours required to receive those bonuses (if available), and the date those bonuses will be paid. Today, we unveil that table for your viewing pleasure. We will update this table on a daily basis, sometimes multiple times, as firms announce bonus news. If you see any information here that is incorrect or needs clarification, tell us.\nHelp us help you now (and if/when you decide to make a lateral move in the future). Let us know what your firm’s minimum billable hours targets are for bonus eligibility and when your firm will pay those bonuses. You generally must remain at your firm until the payout date to receive them, as stated in most memos, which could make it all the more difficult for you to leave your job.\nAs a little reminder, we love covering the Biglaw bonus season, but we need your help. As soon as your firm’s bonus memo comes out, please email it to us (subject line: “[Firm Name] Bonus”). We always keep our sources on bonus stories anonymous. There’s no need to send the memo using your firm email account; your personal email account is fine. Please be sure to include the memo as proof; we like to post complete bonus memos as a service to our readers. You can take a photo of the memo and attach as a picture if you are worried about metadata.\nDon’t forget, if you’d like to sign up for ATL’s Bonus Alerts, please enter your email address in the box below. If you previously signed up for the bonus alerts, you don’t need to do anything. You’ll receive an email notification within minutes of each bonus announcement that we publish. Cheers to a happy bonus season, everyone!\nStaci Zaretsky is a senior editor at Above the Law, where she’s worked since 2011. She’d love to hear from you, so please feel free to email her with any tips, questions, comments, or critiques. You can follow her on Twitter or connect with her on LinkedIn.\nEnter your email address to sign up for ATL's Bonus & Salary Increase Alerts.\nTOPICS\n2022 Bonus Tracker, Associate Bonus Watch 2022, Associate Compensation Scorecard, Biglaw, Bonus News Alerts, Bonuses, Money",
  "title": "Law Firms Matching Bonus Scale",
  "category": "Business and Finance",
  "summary": "Law firms in the United States are gradually matching the market bonus scale set by Baker McKenzie and Cravath. A table is being compiled to track the firms that have matched the scale, along with the minimum hours required for eligibility and the payout dates. Readers are encouraged to provide bonus memos for inclusion in the article.",
  "score": {
    "day": {
      "score": "30",
      "reason": "While significant for law firm associates, this news article does not have immediate political or economic consequences. It primarily appeals to those within the legal profession and may not generate widespread public attention in the short term."
    },
    "week": {
      "score": "40",
      "reason": "Over the course of a week, more law firms may announce their bonuses, increasing the impact of this trend within the legal industry. However, it is still unlikely to have significant political or economic implications beyond the legal sector."
    },
    "month": {
      "score": "50",
      "reason": "As more law firms match the bonus scale, it could potentially lead to changes in associate compensation practices across the industry. This could have some economic consequences and may generate more public attention and discussion within the legal community. However, it is still a relatively niche topic with limited broader societal impact."
    }
  },
  "site_name": "aboveTheLaw",
  "link": "https://abovethelaw.com/2022/12/biglaw-bonus-tracker-2022/"
},
{
  "_id": {
    "$oid": "651ba78c2bf5333b49803dde"
  },
  "article": "LawVu, the category-defining legal workspace for in-house legal teams, today announced the addition of several new AI enhancements to their legal workspace.\nThese new feature releases come at a time when many in-house legal teams are seeing an increase in burnout and feeling pressure from their organizations to prioritize productivity and efficiency gains across their legal function (Source: The 2023 In-house Legal Technology Report). \nMuch like the legal workspace at large, these new AI-powered features optimize efficiency and grant time back to busy in-house legal professionals, helping them to unlock valuable data and action contracts faster. \nWith the introduction of AI-powered import and review, in-house legal teams can now import existing contracts into LawVu in bulk, much faster than before. AI-contract extraction then automatically captures and pulls out key contract clauses and other important data, saving a huge amount of administrative time and ensuring data integrity. LawVu has also released their new AI assist feature, currently in beta, which is a natural language processing tool that reviews and summarizes key contract information so in-house legal teams and their colleagues can quickly get answers to questions surrounding contracts. \nTo bring the new functionality to life, LawVu has made strategic partnerships with AI leaders Zuva and Microsoft to ensure customer data is stored and processed with the same strict security and compliance measures as the rest of the LawVu offering. \n“At Zuva, we’re focused on making it dead simple to use our contracts AI, which we’ve been building since 2011 and has been used on millions of agreements. We’re pleased to partner with LawVu to help them offer innovative solutions to the in-house legal industry in the most secure and reliable way,” says Noah Waisberg, CEO and Co-Founder of Zuva.\nLegal professionals using LawVu were already taking advantage of the ability to manage their matters, contracts, and vendor spend all in one place. Now with the power of AI embedded in the legal workspace, it’s even easier for legal teams to save precious time and do more with less resources – something that’s more important than ever in today’s economic climate. \n“In-house legal professionals are under more pressure than ever before to deliver results quickly and accurately. Bringing these new AI enhancements into the LawVu legal workspace is just another step in helping in-house legal teams save time so they can focus on the more important issues at hand,” says Sam Kidd, CEO and Co-founder of LawVu.\nLawVu is hosting a webinar demonstrating their new AI features on June 2, 2023, 12 p.m. PT. Registrations are available on the LawVu website. \nTOPICS\nArtificial Intelligence (AI), In-House Counsel, LawVu, Microsoft, Sponsored Content, Technology, Zuva",
  "title": "LawVu Introduces AI Enhancements to Optimize Efficiency for In-House Legal Teams",
  "category": "Law and Crime",
  "summary": "LawVu, the legal workspace for in-house legal teams, has announced the addition of new AI enhancements to their platform. These features aim to improve efficiency and save time for busy in-house legal professionals by automating tasks such as contract import and review. The partnership with AI leaders Zuva and Microsoft ensures data security and compliance.",
  "score": {
    "day": {
      "score": "40",
      "reason": "While the AI enhancements in the legal workspace are significant for in-house legal teams, their immediate impact may be limited to the legal industry. It may not have a direct influence on governmental policies, international relations, or geopolitical dynamics."
    },
    "week": {
      "score": "60",
      "reason": "Over the course of a week, the AI enhancements could have a moderate economic impact by improving productivity and efficiency for in-house legal teams. This could potentially lead to cost savings and increased effectiveness in legal operations."
    },
    "month": {
      "score": "50",
      "reason": "In the long term, the AI enhancements in the legal workspace could contribute to broader social consequences by streamlining legal processes and allowing legal professionals to focus on more important issues. However, the impact may still be limited to the legal industry and may not generate significant public attention or media coverage outside of legal circles."
    }
  },
  "site_name": "aboveTheLaw",
  "link": "https://abovethelaw.com/2023/05/lawvu-enhances-contract-matter-functionality-with-ai/"
},
{
  "_id": {
    "$oid": "651ba78c23332cab49803de0"
  },
  "article": "Here’s a riddle for you: when is old too old? I can answer that question for myself. However, this is not about me. It’s about other people, like Pauline Newman, Dianne Feinstein, and yes, Joe Biden. (I could include Donald Trump in the mix, but I won’t.) When are you too old to be a judge, to be a senator, to be a president? To be a CEO? To be a managing partner of a law firm?\nA lot of people are asking those questions, given the current landscape of old folks still in charge of so much. (And let’s put aside potential age-discrimination issues.) Is it a reluctance to relinquish power? Is it that we haven’t mentored and helped younger generations to take on leadership responsibilities? Is it that we old people are unwilling to acknowledge that age can be more than just a number? I am not suggesting that there should be competency tests for those of us who are of a certain age or older. As we all know, you can be brilliant in your 80s and 90s and dumb as a rock in your 40s. But I wonder if we are depriving leadership opportunities to those younger than us who are chomping at the bit to get going.\nPauline Newman, a federal circuit judge on the D.C. Circuit, is suing her colleagues, claiming that they have tried to force her to retire. She is 95 with a lifetime appointment. Her colleagues have formed an “investigative committee” to determine whether she is able both physically and mentally to continue her work as an appellate judge — the oldest active federal judge in the nation. Newman alleges that, among other things, the chief judge has refused to assign any new cases to her as a vehicle to pressure her to retire.\nThe Non-Event Industry Wrap-Up\nNewman’s case raises a whole slew of issues about lawyers and judges and how and when they should exit the stage. Part of the problem for many lawyers (and judges as well) is the lack of planning for this next stage of life. In other words, “Now what?” Many lawyers have focused on the law to the exclusion of just about everything else, and so, when they do retire, whether voluntarily or with a well-placed foot on the butt, they are often totally adrift. How to use all the skills honed over decades of practice? How to leverage the legal knowledge that these people have in ways small and large that may benefit others? There aren’t any answers that readily come to mind, and no, pro bono work is not necessarily the answer. Many lawyers, whether paid or not, are done representing clients.\nTake comfort, however small it may be, that our profession is not the only one wrestling with the issue of when the younger people can take control. In a recent article in Vanity Fair magazine, the talent agency business (remember I live in Lala Land) is seeing defections of younger agents who are tired of waiting for the old guard to leave.\nAs the article relates, the “old guard,” now in their sixties, has reminded the younger agents that “60 is the new 40.”\nOne younger agent said, “I was like, fuck no, it’s not,” He thought that the oldsters “are never going to leave.” So, it’s not the old guard leaving, it’s the young ones who see their road to accession blocked, maybe not permanently, but at least for the foreseeable future.\nSponsored\n\n\nThe Non-Event Industry Wrap-Up \n\n\n\nAdvancing AI Safety: Law Student Competition For Drafting A Treaty On Moratorium Of Large-Scale AI Capabilities R&D \n\n\n\nHow Overture Law Is Revolutionizing Referral Fees \n\nLawVu Enhances Contract & Matter Functionality With AI\nWho wants to wait to be 73 to be crowned king? We all know one who had to do so but given that the rest of us are not royalty in any sense except perhaps in our own minds, waiting is no longer the only option. As the article points out, if these younger ones do wait, they could be chanting the same mantra in 20 years, that “60 is the new 40.” History does repeat itself.\nWhat the article also points out is the generational shift underway and not just for talent agents. It’s for lawyers as well. General counsel and others who referred business to the oldsters have retired or are no longer able to do that. The younger lawyers have their own sources of business (or they should) and so the need to rely upon the largesse of gray-haired leaders is diminishing. Client demands are also shifting. The younger people aren’t impressed with conference rooms the size of bowling alleys nor are they impressed with the trappings that their fees are funding.\nWe’ve all seen how the pandemic has changed the provision of legal services. And what we’ve also seen is how lawyers want to be more in control of their own lives, their own careers. While there will always be a “Biglaw,” just like “there will always be an England,” work-life balance is no longer just a mantra, but a life-career choice. As one of the younger talent agents in the Vanity Fair article noted, the oldsters run the shop. “But I just kept coming back to, why work for anybody again? It’s their agency. It’s their vision. It just felt the most appropriate next step for me was to do something that was at least partly mine.”\nSound familiar? It does to anyone who has pondered what next and has decided that the best thing is to take a leap, accompanied by the new technologies that are changing the face of practice today and clients who are tech-savvy and want services provided in more efficient and economical ways. This is not your parents’ profession anymore.\nAnd if we need any proof of that, Staci Zaretsky’s post about a would-be Biglaw partner who said “goodbye to all that” is precisely on point. Res ipsa loquitur.\nSponsored\n\n\nLawVu Enhances Contract & Matter Functionality With AI \n\n\n\nThe Essential Guide to Slack eDiscovery \n\nJill Switzer has been an active member of the State Bar of California for over 40 years. She remembers practicing law in a kinder, gentler time. She’s had a diverse legal career, including stints as a deputy district attorney, a solo practice, and several senior in-house gigs. She now mediates full-time, which gives her the opportunity to see dinosaurs, millennials, and those in-between interact — it’s not always civil. You can reach her by email at oldladylawyer@gmail.com.\nTOPICS\nBiglaw, Jill Switzer",
  "title": "Age and Leadership: When is Old Too Old?",
  "category": "Law and Crime",
  "summary": "The article discusses the issue of age in leadership roles, focusing on examples such as federal judge Pauline Newman and the talent agency business. It raises questions about when individuals should retire and whether younger generations are being deprived of leadership opportunities. The article also highlights the need for lawyers and judges to plan for their next stage of life and adapt to the changing demands of clients.",
  "score": {
    "day": {
      "score": "40",
      "reason": "While the topic of age in leadership is relevant and can spark discussions, it may not have an immediate impact on political or economic events within a day."
    },
    "week": {
      "score": "60",
      "reason": "The article's exploration of age in leadership roles and the generational shift underway in various industries can have broader social consequences and implications for the future of leadership."
    },
    "month": {
      "score": "70",
      "reason": "The article's examination of age in leadership and the need for adaptation in the legal profession and talent agency business reflects broader societal changes and challenges in various sectors. It can contribute to ongoing discussions about age diversity and succession planning."
    }
  },
  "site_name": "aboveTheLaw",
  "link": "https://abovethelaw.com/2023/06/goodbye-to-all-that-2/"
}]